* what is pandas
    => Pandsa is open source open library written in python
    => It leverages the power and speed of numpy to make analysis and processing easy for data scientists
    => It provides rich and highly rebust data operatins
* Pandas data structures
    => Pandas has two types of data structure
     1. Series - It is onde dimensional array with structure. It stores a single coloum or row of data in a DataFrame
     2. Dataframe - It is a tabular spreadsheet like structure representing rows each of which one or multiple coloums
* A one-dimensional array(labeled) capable of holding any type of data Series 
* A tow-dimensional data(labeled) structure with coloums of potentially different type of data - frame

In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "Students Name":["Ajay Kumar","Chandan Roy","Manohar Suman","Sumit Gupta","Akash Anand"],
    "Students Marks":[60,70,80,90,100],
    "Students Cities":["Darbhanga","Patna","Madhubani","MujhaffarPUr","Chapra"]
}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

   Students Name  Students Marks Students Cities
0     Ajay Kumar              60       Darbhanga
1    Chandan Roy              70           Patna
2  Manohar Suman              80       Madhubani
3    Sumit Gupta              90    MujhaffarPUr
4    Akash Anand             100          Chapra

In [6]:
df.to_csv('studentsDetails.csv') # It will convert the data in excel file with index

In [7]:
df.to_csv('datalist.csv', index=False) # It will convert data set in excel sheet without index

In [8]:
df.head(2) # It will show the top 2 rows

  Students Name  Students Marks Students Cities
0    Ajay Kumar              60       Darbhanga
1   Chandan Roy              70           Patna

In [9]:
df.tail(3) # It will show bottom 3 rows

   Students Name  Students Marks Students Cities
2  Manohar Suman              80       Madhubani
3    Sumit Gupta              90    MujhaffarPUr
4    Akash Anand             100          Chapra

In [10]:
df.describe() # It will return the list of numberical analysis

       Students Marks
count        5.000000
mean        80.000000
std         15.811388
min         60.000000
25%         70.000000
50%         80.000000
75%         90.000000
max        100.000000

In [11]:
Data = pd.read_csv('train.csv') # It will read all csv data

In [12]:
Data

   Unnamed: 0  Train No  Speeds       Cities
0           0     12560     199     Darbhanga
1           1     12630      70         Patna
2           2     12740      80     Madhubani
3           3     13555      90  MujhaffarPUr
4           4     18590     100        Chapra

In [13]:
Data['Speeds'] # It return all data of Speeds coloum

0    199
1     70
2     80
3     90
4    100
Name: Speeds, dtype: int64

In [14]:
Data['Speeds'][0] # It return data of speeds of index 0th position

199

In [15]:
Data['Speeds'][0] = 199

c:\users\ajay\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [16]:
Data

   Unnamed: 0  Train No  Speeds       Cities
0           0     12560     199     Darbhanga
1           1     12630      70         Patna
2           2     12740      80     Madhubani
3           3     13555      90  MujhaffarPUr
4           4     18590     100        Chapra

In [17]:
Data.to_csv('train.csv') # It will update the train csv file

In [18]:
Data.index = ["First","Second","Third","Fourth","Fifth"] # It will update the index

In [19]:
Data

        Unnamed: 0  Train No  Speeds       Cities
First            0     12560     199     Darbhanga
Second           1     12630      70         Patna
Third            2     12740      80     Madhubani
Fourth           3     13555      90  MujhaffarPUr
Fifth            4     18590     100        Chapra

In [22]:
ser = pd.Series(np.random.rand(35)) # It return series of random data

In [23]:
ser

0     0.634814
1     0.317508
2     0.155295
3     0.958682
4     0.281028
5     0.331235
6     0.566813
7     0.955102
8     0.771051
9     0.240946
10    0.249710
11    0.909943
12    0.862831
13    0.131374
14    0.124464
15    0.876426
16    0.348954
17    0.103529
18    0.058237
19    0.348674
20    0.471036
21    0.216948
22    0.161342
23    0.853991
24    0.004345
25    0.266319
26    0.245937
27    0.248658
28    0.853139
29    0.398664
30    0.877086
31    0.973501
32    0.813273
33    0.673393
34    0.675039
dtype: float64

In [24]:
type(ser)

pandas.core.series.Series

In [26]:
newDf = pd.DataFrame(np.random.rand(334,5), index = np.arange(334))

In [27]:
newDf

            0         1         2         3         4
0    0.706315  0.588032  0.432754  0.539402  0.892342
1    0.477402  0.758813  0.159585  0.363634  0.187771
2    0.815983  0.037700  0.379325  0.485228  0.184567
3    0.983910  0.749917  0.165964  0.831872  0.506460
4    0.584249  0.459591  0.914059  0.184008  0.026480
..        ...       ...       ...       ...       ...
329  0.602750  0.844224  0.784580  0.026749  0.863517
330  0.366629  0.242092  0.973807  0.879800  0.280263
331  0.234199  0.820342  0.533372  0.875768  0.674466
332  0.396188  0.959661  0.677742  0.071121  0.039465
333  0.018560  0.708743  0.705117  0.168268  0.692165

[334 rows x 5 columns]

In [28]:
type(newDf)

pandas.core.frame.DataFrame

In [29]:
newDf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.495769    0.477574    0.465915    0.498966    0.478263
std      0.282948    0.297533    0.284435    0.293165    0.302101
min      0.000144    0.002289    0.001228    0.000146    0.000444
25%      0.264858    0.204502    0.203908    0.256914    0.220528
50%      0.497619    0.463340    0.434343    0.510177    0.438566
75%      0.730325    0.750780    0.726069    0.747982    0.752549
max      0.996188    0.997527    0.999699    0.997766    0.997383